app/views/groups/show.html.erb

        <ul class="list-group list-group-flush">
            <% @group.expenditures.each do |expenditure| %>
---
SELECT "expenditures".* FROM "expenditures" WHERE "expenditures"."group_id" = $1 ORDER BY "expenditures"."created_at" DESC  [["group_id", 1]]