app/controllers/expenditures_controller.rb

  def index
    @expenditures = if params[:ungrouped]
                      current_user.ungrouped_expenditures_from_user(current_user.id)
                    else
                      current_user.expenditures.all
---
SELECT "expenditures".* FROM "expenditures"

  def show
    @expenditure = Expenditure.find(params[:id])
---
SELECT "expenditures".* FROM "expenditures" WHERE "expenditures"."id" = $1 ORDER BY "expenditures"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @expenditure = Expenditure.new(expenditure_params)
    @expenditure.author_id = current_user.id

    respond_to do |format|
      if @expenditure.save
---
INSERT INTO "expenditures" ("name", "amount", "created_at", "updated_at", "group_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Drugs"], ["amount", 33000], ["created_at", "2021-06-03 18:25:21.187906"], ["updated_at", "2021-06-03 18:25:21.187906"], ["group_id", 3]]

  def update
    respond_to do |format|
      if @expenditure.update(expenditure_params)
---
UPDATE "expenditures" SET "name" = $1, "updated_at" = $2 WHERE "expenditures"."id" = $3  [["name", "Fees"], ["updated_at", "2021-06-02 17:36:50.596130"], ["id", 12]]

  def destroy
    @expenditure.destroy
---
DELETE FROM "expenditures" WHERE "expenditures"."id" = $1  [["id", 7]]

  def expenditures_created
    Expenditure.ascending.pluck(:name)
---
SELECT "expenditures"."name" FROM "expenditures" ORDER BY "expenditures"."created_at" DESC, "expenditures"."name" ASC

  def create_groups_array
    arr = Group.all.pluck(:name, :id)
---
SELECT "groups"."name", "groups"."id" FROM "groups" ORDER BY "groups"."name" ASC

  def set_expenditure
    @expenditure = Expenditure.find(params[:id])
---
SELECT "expenditures".* FROM "expenditures" WHERE "expenditures"."id" = $1 ORDER BY "expenditures"."created_at" DESC LIMIT $2  [["id", 13], ["LIMIT", 1]]