app/controllers/groups_controller.rb

  def index
    @groups = Group.includes(:user) # For eager loading
---
SELECT "groups".* FROM "groups"

  def create
    @group = current_user.groups.build(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Transportation"], ["created_at", "2021-06-03 23:43:25.412396"], ["updated_at", "2021-06-03 23:43:25.412396"]]

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE "groups" SET "updated_at" = $1 WHERE "groups"."id" = $2  [["updated_at", "2021-06-02 11:53:02.972515"], ["id", 5]]

  def destroy
    @group.destroy
---
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]