app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "mih julius "], ["email", "mihndim2016@gmail.com"], ["created_at", "2021-06-01 00:26:44.349497"], ["updated_at", "2021-06-01 00:26:44.349497"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2021-06-01 00:44:25.399975"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)