app/views/expenditures/_form.html.erb

SELECT "groups".* FROM "groups" ORDER BY "groups"."name" ASC
---
    <%= form.label :group_id, class: 'input-group-text' %>
    <%= form.collection_select(:group_id, Group.all, :id, :name, {include_blank: true}, {class: 'group-select w-100'}) %>